EDT/УТ/src/Documents/АктРасхожденияПоПриходу_КУдалению/АктРасхожденияПоПриходу_КУдалению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктРасхожденияПоПриходу_КУдалению</name>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <attributes>
    <name>ФактическийПриходЗаказов</name>
    <type>
      <types>DocumentRef.ФактическийПриходЗаказовНаСклад</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасхождения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыРасхождения</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасхождения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/АктРасхожденияПоПриходу_КУдалению/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаказыПриАктивизацииСтроки(Элемент)
	Если Элементы.Заказы.ТекущиеДанные <> Неопределено Тогда
		Элементы.ТоварыРасхождения.ОтборСтрок = Новый ФиксированнаяСтруктура("Заказ", Элементы.Заказы.ТекущиеДанные.Заказ.Ссылка);
        Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Заказ", Элементы.Заказы.ТекущиеДанные.Заказ.Ссылка);
	КонецЕСли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРасхожденияТоварНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
     СтандартнаяОбработка = Ложь;

    //Данные для отбора
    Заказ = Элементы.Заказы.ТекущиеДанные.Заказ;
    Если НЕ ЗначениеЗаполнено(Элементы.ТоварыРасхождения.ТекущиеДанные.Заказ) Тогда
        Элементы.ТоварыРасхождения.ТекущиеДанные.Заказ = Заказ;        
    КонецЕсли;
    НайтиСтрокиТовары = Объект.Товары.НайтиСтроки(Новый Структура("Заказ",Заказ));
    СписокОтбора = Новый СписокЗначений;
    Для каждого Стр Из НайтиСтрокиТовары Цикл
        СписокОтбора.Добавить(Стр.Товар);
    КонецЦикла;
    ПараметрыВыбора = Новый Структура("РежимВыбора",Истина ); 
    
    ФормаВыбора = ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораУправляемая",ПараметрыВыбора,Элемент); //Открываем форму
    ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список; 
    ОтборВладелец =ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); //Добавлям отбор
    ОтборВладелец.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; //Как будем сравнивать
    ОтборВладелец.Использование = Истина; // Устанавливаем галку использованияНовый ПолеКомпоновкиДанных("Номенклатура")
    ОтборВладелец.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка"); //По какому реквизиту будем делать отбор
    ОтборВладелец.ПравоеЗначение = СписокОтбора;
    
    
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПоЗаказуНаСервере()
    Объект.ТоварыРасхождения.Загрузить(Объект.Товары.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаказу(Команда)
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Вопрос("Табличная часть будет перезаполнена. Продолжить?", Режим, 0);
    Если Ответ = КодВозвратаДиалога.Да Тогда
        ЗаполнитьПоЗаказуНаСервере();
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТоварыРасхожденияКоличествоПриИзменении(Элемент)
    //ТоварыРасхожденияКоличествоПриИзмененииНаСервере();
    ТекущиеДанные = Элементы.ТоварыРасхождения.ТекущиеДанные;
    ТекущиеДанные.СуммаРасхождения = ТекущиеДанные.Количество*ТекущиеДанные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПередУдалением(Элемент, Отказ)
    
    ТекущиеДаннные =  Элементы.Заказы.ТекущиеДанные;
    Заказ = ТекущиеДаннные.Заказ;
    
    МассивТоваров = Объект.ТоварыРасхождения.НайтиСтроки(Новый Структура("Заказ",Заказ));
    Для каждого Стр Из МассивТоваров Цикл
        Объект.ТоварыРасхождения.Удалить(Стр);
    КонецЦикла;
    
    МассивТоваров = Объект.Товары.НайтиСтроки(Новый Структура("Заказ",Заказ));
    Для каждого Стр Из МассивТоваров Цикл
        Объект.Товары.Удалить(Стр);
    КонецЦикла;
   
КонецПроцедуры


//&НаСервере
//Процедура ТоварыРасхожденияКоличествоПриИзмененииНаСервере()
//    ТекущиеДанные = Элементы.ТоварыРасхождения.ТекущиеДанные;
//    ТекущиеДанные.СуммаРасхождения = ТекущиеДанные.Количество*ТекущиеДанные.Цена;
//КонецПроцедуры
